# StairsActualTreadDepthLessThanMinimumFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..StairsActualTreadDepthLessThanMinimumFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Computed actual tread depth of stairs is less than minimum tread depth defined in stairs type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StairsActualTreadDepthLessThanMinimumFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsActualTreadDepthLessThanMinimumFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StairsActualTreadDepthLessThanMinimumFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace